[{"getTime":"15:57","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/phpHGvrL1.jpg","title":"武漢肺炎》全球確診逾8338萬 超過181萬人病故","totaltext":"〔中央社〕法新社彙整官方數據顯示，截至格林威治標準時間7日11時（台灣7日晚間7時），全球至少181萬8946人死於2019冠狀病毒疾病（COVID-19，武漢肺炎），至少8338萬1330例確診。<br><br>疫情從去年12月在中國爆發，迄今全球至少有5253萬4200人被認為已康復。<br><br>法新社蒐集各國當局和世界衛生組織（WHO）提供的數據做出統計，但這恐怕只是實際感染總數的一部分，因為許多國家只檢測有症狀或症狀最嚴重的病例。<br><br>全球5日通報新增1萬3629人病歿、72萬8621起確診病例。根據通報數據，新增病歿人數最多國家依序為美國（3426死）、巴西（1074死）與英國（964死）。<br><br>美國仍是疫情最嚴重國家，累計34萬5844人病故、1997萬4883例確診。<br><br>其他疫情嚴重國家還包括巴西（19萬4949人喪生、767萬5973例確診）、印度（14萬8994人喪生、1028萬6709例確診）、墨西哥（12萬5807人喪生、142萬6094例確診）及義大利（7萬4159人喪生、210萬7166例確診）。<br><br>依照染疫死亡人數占人口比例，比利時是死亡率最高國家，每10萬人就有168人染疫喪命；接下來依序為斯洛維尼亞（130人）、波士尼亞與赫塞哥維納（123人）、義大利（123人）、北馬其頓共和國（120人）。<br><br>從區域來看，歐洲累計57萬4012死、2656萬9711例確診；拉丁美洲和加勒比海地區累計50萬7687死、1556 萬9105例確診；美國和加拿大共計36萬1440死、2055萬4203例確診。<br><br>"},{"getTime":"15:40","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/phpFyXzw8.jpg","title":"武漢肺炎》南非購買150萬劑AZ疫苗 醫護人員先施打","totaltext":"〔即時新聞／綜合報導〕南非政府週四表示將進口150萬劑英國藥廠阿斯特捷利康（AstraZeneca, AZ）與牛津大學共同研發的武漢肺炎（新型冠狀病毒病，COVID-19）疫苗，為南非的衛生醫療人員接種。<br><br>綜合外媒報導，南非衛生部長姆赫茲（Zwelini Mkhize）說明，第一批100萬劑AZ疫苗將在本月從印度血清研究所送達，緊接著2月才提供剩下的50萬劑。<br><br>南非疫情急速升溫，激增的確診案例正迅速超越第一波高峰，週三南非才宣布了創紀錄的單日2萬1832例新確診案例和844例累積死亡案例。<br><br>醫學專家表示，近幾週激增的案例，是由於新型變種病毒崛起導致傳播迅速。許多南非的醫院都表示醫院已經不堪負荷了。<br><br>不過南非並不是非洲國家中唯一宣布購買疫苗的國家，摩洛哥在上個月宣布已向中國國藥集團和阿斯特捷利康訂購了6500萬劑武漢肺炎疫苗。<br><br>姆赫茲表示，南非的公私立醫院總共有125萬名醫護人員，政府已經決定將醫護人員列為優先保護對象。<br><br>"},{"getTime":"15:40","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/phpv80JzU.jpg","title":"武漢肺炎》祭「休克療法」！ 加拿大魁北克週六起宵禁","totaltext":"〔即時新聞／綜合報導〕加拿大人口第二多魁北克省將在週六起實行「休克療法」（shock therapy），也就是宵禁和相關政策，以應對持續增長武漢肺炎（新型冠狀病毒病，COVID-19）的感染人數，挽救瀕臨崩潰的醫療系統。<br><br>綜合外媒報導，武漢肺炎爆發以來，魁北克的死亡人數已達到8488人，且每日新增病例和死亡人數持續增長。魁北克健康諮詢小組去年12月警告，如果住院人數持續增加，醫療體系可能會在1月底前崩潰。<br><br>魁北克衛生部的數據顯示，目前約有1400人因武肺住院，僅次於安大略省。<br><br>魁北克省省長勒戈（Legault）說，週六起將實施多項新的封鎖措施，包括關閉餐館、體育館、劇院和大多數零售商店至少4週，到2月8日。他形容新措施為「休克療法」，指出未來一個月是關鍵時刻。<br><br>其中的宵禁措施，將要求當地民眾在晚上8點到隔日凌晨5點必須待在家中，雜貨店和公司也被要求在晚上7時30分關閉，讓人們有時間回家。不遵守宵禁規定的人可能面臨最高6000加元（約新台幣13萬元）的罰款。<br><br>宵禁將適用於除了魁北克北部行政區域以外的其他地區，此外藥房和加油站允許在宵禁時間開放。勒戈說，他希望當地遊民也能夠遵守宵禁，魁北克的庇護所有足夠的房間供他們居住。<br><br>"},{"getTime":"15:01","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/phpNa6Erw.jpg","title":"武漢肺炎》人車不准離市！中國河北石家莊新增11確診","totaltext":"〔即時新聞／綜合報導〕中國河北省近日爆發武漢肺炎（新型冠狀病毒病，COVID-19）疫情，省會石家莊市今（７）日通報新增11例確診，並宣布全市所有車輛及人員不得離市，對外交通全數停擺。<br><br>根據中媒報導，石家莊市副市長孟祥紅在記者會上表示，截至今日中午12點，已完成241萬6695人次的病毒檢測，發現11人呈陽性反應，另外疫情嚴重的藁城區已完成第一次全員檢測，而增村鎮會再進行一次檢測。<br><br>孟祥紅也指出，由於石家莊市正在進行全員病毒檢測，因此全市所有車輛、人員均不出市，被列為高風險地區的藁城區人員更不行離開該區域。<br><br>據報導，截至今日下午5點，中國全境內共有50個中風險地區與1個高風險地區。遼寧省瀋陽市與大連市共計33處，黑龍江省境內有7處，河北省邢台市有3處，而北京順義區與朝陽區也有7個地點被列為中風險。<br><br>"},{"getTime":"14:48","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/phpElO9Lz.jpg","title":"親中國家也怕中國疫苗？尼泊爾官員：更想拿印度疫苗","totaltext":"〔即時新聞／綜合報導〕中國不斷對外宣傳自行研製的武漢肺炎（新型冠狀病毒病，COVID-19）疫苗功效，但除了傳出中國醫療人員拒絕施打中國疫苗，還有中國疫苗專家直指中國疫苗「世界上最不安全」。印度媒體報導，親中的尼泊爾政府官員透露，比起中國疫苗，尼泊爾更喜歡從印度獲得疫苗。<br><br>根據《印度斯坦時報》報導，尼泊爾外交部長吉瓦利（Pradip Gyawali）將於14日訪問印度，與印度外交部長蘇杰生（Subrahmanyam Jaishankar）舉行第6次尼泊爾與印度聯合委員會會議，預計在吉瓦利訪印期間，尼泊爾能獲得新德里承諾供應由印度生產的1200萬劑武漢肺炎疫苗。<br><br>報導指出，雖然中國主動表達願意將中國科興（SinoVac）公司研發的疫苗提供給尼泊爾政府，但尼泊爾官員卻表示，尼泊爾政府更喜歡從印度獲得疫苗，似乎由親中的總理奧利（K.P. Sharma Oli）所領導的尼泊爾也對中國疫苗有所疑慮。<br><br>另外，吉瓦利與蘇杰生舉行雙邊聯合委員會會議時，預料會對尼泊爾公布新地圖納入與印度有主權爭端土地的議題進行商談，希望有一個雙方都滿意的答案。<br><br>中共一個高層小組上月底赴尼泊爾與總理奧利等人會面，接著又與尼泊爾共產黨反奧利派系領袖達哈爾會面，企圖避免尼共分裂，維持親中的奧利政權。<br><br>"},{"getTime":"14:25","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/php68zsTr.jpg","title":"圍爐也不行！自主健康管理禁止外出聚會 違者最重罰30萬","totaltext":"〔記者林惠琴／台北報導〕居家檢疫、居家隔離者禁止外出，但可以出門的自主健康管理者，到底能夠對外交流到什麼程度？不少民眾霧煞煞，可能不小心就觸法。中央流行疫情指揮中心今日更新自主健康管理的問答集，明確規定「禁止外出聚餐或聚會」，春節到飯店、餐廳圍爐也不行，並且不可參加大型活動，違者最高可開罰30萬元。<br><br>根據指揮中心的新版自主健康管理QA明確指出，自主健康管理者如沒有出現任何症狀，可正常生活，進入超商或超市須全程戴口罩，若場所內人潮已多、不易保持社交距離，應避免進入或長時間逗留。<br><br>此外，大型活動具有參加人數眾多、不易保持社交距離，以及會近距離接觸不特定人士的特性，一旦出現疑似個案或群聚事件，會提高防疫難度，考量自主健康管理者仍無法完全免除感染風險，因此禁止參加大型活動。<br><br>另外，由於用餐時無法全程戴口罩，在此期間應避免外出用餐，建議可外帶食物儘速返家食用，而聚餐或聚會為交流場合，難以落實全程戴口罩，也難以避免近距離交談，具有傳染風險，因此禁止聚餐或聚會。<br><br>至於春節圍爐，指揮中心發言人莊人祥表示，若有自主健康管理者，就不宜到餐廳或飯店吃飯，由於親友是特定人士，可在家中圍爐，但仍應避免與其他家人有過多的親密互動，且吃完最好戴上口罩。<br><br>莊人祥指出，若是「居家隔離」後的自主健康管理者，違規可依「傳染病防治法」處6萬元至30萬元罰鍰；「居家檢疫」後的自主健康管理者或一般自主健康管理者，違規也可開罰1萬元至15萬元。<br><br>"},{"getTime":"14:07","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/phpPLgQ1T.jpg","title":"疫情重創！倫敦恐30年來首次人口萎縮 大減逾30萬人","totaltext":"〔即時新聞／綜合報導〕由於武漢肺炎（新型冠狀病毒病，COVID-19）肆虐，加上疫情對經濟重創，英國首都倫敦可能出現過去30年來第一次的人口下滑。<br><br>據外媒報導，普華永道（PwC）會計師事務所一份報告指出，今年居住在倫敦的人口可能會減少30萬以上，從2020年的900萬下降至870萬，這也將是1988年以來首次出現人口下滑，結束長達數十年的人口增長。<br><br>這份報告預測，由於城市遭到封鎖，加上在家工作的型態興起，居民會重新考慮搬到其他地方。而且因為倫敦在資訊科技和金融業的工作比例較高，所以也比較有機會選擇遠距上班。<br><br>除了疫情，還有其他因素推了一把，例如畢業生都去倫敦找工作，相對地使就業機會變少；且英國脫歐後，國際移民人數也會降低。其實從2016年英國脫歐公投以來，從歐盟往英國移民的人數就開始下降；普華永道預測，到2021年，離開英國至歐盟的人數將超過從歐盟往英國的人數。<br><br>普華永道進一步指出，英國在2021年嬰兒出生率會出現下降潮，甚至跌破一個多世紀以來的最低紀錄。<br><br>"},{"getTime":"13:26","imgsrc":"https://img.ltn.com.tw/Upload/news/600/2021/01/07/php0qmeI9.jpg","title":"武漢肺炎》日本兩次緊急事態宣言 範圍跟限制大不相同","totaltext":"〔中央社〕時隔9個月，日本政府今天針對2019冠狀病毒疾病（COVID-19）疫情二度發布「緊急事態宣言」。擔憂對經濟造成影響，這次宣言適用範圍較上次縮小許多，限制措施也相對「有限」。<br><br>日本2020年4月7日首度發布「緊急事態宣言」，綜合日本放送協會（NHK）、產經新聞、日本經濟新聞等日媒報導，兩次宣言在對象地區範圍與限制措施等方面，都有明顯不同。<br><br>●這次宣言對象地區縮小 限制措施有限<br><br>去年4月7日首度發布宣言對象地區為1都1府5縣（東京都、大阪府、千葉縣、神奈川縣、埼玉縣、兵庫縣及福岡縣），並在4月16日擴及全日本。<br><br>之後根據各地疫情減少適用地區，到同年5月25日全境解禁。<br><br>這次宣言的對象地區十分限縮，僅針對首都圈1都3 縣（東京都、千葉縣、神奈川縣、埼玉縣），預計為期一個月到2月7日止；但仍會看宣言發布後的疫情發展，來看屆時是解除或延長。<br><br>這次宣言案中明載「將盡快解除緊急事態」，只要對象地區疫情狀況能從最嚴重的第4階段，回到次嚴重第3階段的話，就算在一個月的「緊急事態宣言」期間，也可以提前解除。<br><br>不過，分科委員會多數專家都認為，要在一個月內讓疫情趨緩恐有困難。<br><br>日本政府負責防疫工作的經濟再生擔當大臣西村康稔今天在國會答詢時說，要解除這次「緊急事態宣言」的其中一個標準，就是東京單日新增病例數降到500例左右。東京都今天新增2447例。<br><br>不同於上次宣言籲請多數業者停業，日本政府這次提出的基本因應方針方案指出，這次「緊急事態宣言」將籲請餐飲店提前到每晚8時打烊，酒類提供時間限制在每天上午11時到晚間7時止。外送及外帶的餐飲業者不在此限。<br><br>這次宣言籲請對象地區民眾，避免不必要及不緊急的外出行程，特別籲請每晚8時後徹底落實。<br><br>至於各項活動開放進場觀眾人數部分，政府籲請業者以5000人或容納人數5成作為上限。<br><br>●兩次宣言影響<br><br>日本政府厚生勞動省表示，截至本月6日止，有關與疫情相關的解雇與停止雇用，包括預估值在內共8萬121人失業。<br><br>去年失業人口增加最多的時期，就是「緊急事態宣言」發布後的5月，單月增加1萬2949人；到去年9月止每個月約增加1萬人，10月後增加速度減緩。<br><br>日本5家民間智庫估算，首都圈1都3縣這次進入為期一個月的「緊急事態宣言」，個人消費將大幅減少，壓低日本國內生產毛額（GDP）0.3%到0.88%。<br><br>換算成實際金額的話，大約減少1兆4000億日圓到4 兆8900億日圓。<br><br>第一生命經濟研究所估算，這次「緊急事態宣言」發布起半年後，可能會有7萬5000人失業，「可以想像會帶來大的傷害」。<br><br>野村證券、野村綜合研究所等單位預測，日本今年1月到3月的3個月GDP很可能出現負成長。<br><br>不過，由於這次宣言對象及海外經濟狀況都跟去年宣言發布時不同，所以也有看法認為可能不會出現像去年4月到6月那樣大幅的衰退。<br><br>●這次是有限緊急事態<br><br>上次宣言為了減少至少7成的人際接觸，採取了許多減少人員移動的措施。<br><br>去年宣言期間，有關當局強烈呼籲除了必須維持社會機能的人，其他人徹底採取在家工作方式不要外出；除了要外出購買食物或食材或前往醫院看病外，避免不必要及不緊急的外出行程。<br><br>因此，去年宣言期間包括餐飲店、電影院、劇場、百貨公司、飯店、博物館及圖書館等地，都配合暫停營業；另外也有許多公開活動都取消或延期舉辦。<br><br>這次宣言為了盡可能不對經濟造成太大影響，將採取「有限」措施來減少餐飲場所感染風險，可說是「有限」的「緊急事態宣言」。<br><br>有關設施的使用限制，這次「緊急事態宣言」將籲請餐飲店、運動設施、遊樂場所、樓地板面積超過1000 平方公尺的百貨公司等，每晚提前到8時打烊。<br><br>營運東京迪士尼樂園及東京迪士尼海洋的東方樂園公司（Oriental Land）表示，基於地方政府籲請，從8 日起到本月底，將營業結束時間提前到每晚8時。去年「緊急事態宣言」發布期間，這兩處樂園已暫時閉園，但配合緊急事態又延長閉園約一個月。<br><br>●持續推動在家上班<br><br>這次宣言以「減少7成」出門工作的人潮作為目標，都道府縣政府將力促業者推動在家工作及輪班制。<br><br>日立製作所（HITACHI）6日宣布，位於「緊急事態宣言」發布地區的職員，這段期間原則上在家工作；如果不得已一定要到公司的話，每週以1到2天為限。<br><br>三菱電機公司因應疫情擴大在家工作範圍，配合這次「緊急事態宣言」發布，將把到公司的員工比率控制在3成以下。<br><br>整個集團約有18萬名員工的日本電信電話公司（NTT），雖然已以5成員工在家上班作為目標，但接下來將檢討更進一步的對策。<br><br>●這次不籲請學校大規模停課<br><br>上次宣言發布前的2020年3月起，日本政府雖然已全國性讓學校停課，但宣言發布後仍有不少學校持續停課。<br><br>但這次宣言，文部科學大臣萩生田光一5日說，不會要求高中及國中小一律停課；至於大學部分，會要求盡可能活用到校上課與網路教學。<br><br>本月16日要舉行的大學入學共同測驗，將在做好萬全防疫對策的情況下如期實施。<br><br>●學者看法<br><br>日本傳染病學會理事長、東邦大學教授館田一博說，要在短期間抑制疫情擴大雖然有難度，但能不能成功端視每個人能配合到什麼程度。<br><br>熟悉傳染病對策的神戶大學研究所教授岩田健太郎說，這次「緊急事態宣言」發布時間太晚，無法期待效果。<br><br>"}]